OpenNuvoton/M2354BSP/SampleCode/NuMaker/Key/main.c
/******************************************************************************
 * @file     main.c
 * @version  V1.00
 * @brief    A simple key demo for NuMaker board.
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2020 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/
#include <stdio.h>
#include "NuMicro.h"

#define LED_INIT()  (PD->MODE = (PD->MODE &(~(0xful << 2*2))) | (0x5ul << 2 * 2))
#define LED_YELLOW  PD2
#define LED_GREEN   PD3

void SYS_Init(void);
void UART0_Init(void);

void SYS_Init(void)
{

    /*---------------------------------------------------------------------------------------------------------*/
    /* Init System Clock                                                                                       */
    /*---------------------------------------------------------------------------------------------------------*/

    /* Enable HIRC clock */
    CLK_EnableXtalRC(CLK_PWRCTL_HIRCEN_Msk);

    /* Wait for HIRC clock ready */
    CLK_WaitClockReady(CLK_STATUS_HIRCSTB_Msk);

    /* Set core clock to 96MHz */
    CLK_SetCoreClock(96000000);

    /* Enable UART0 module clock */
    CLK_EnableModuleClock(UART0_MODULE);

    /* Select UART0 module clock source as HIRC and UART0 module clock divider as 1 */
    CLK_SetModuleClock(UART0_MODULE, CLK_CLKSEL2_UART0SEL_HIRC, CLK_CLKDIV0_UART0(1));

    /*---------------------------------------------------------------------------------------------------------*/
    /* Init I/O Multi-function                                                                                 */
    /*---------------------------------------------------------------------------------------------------------*/

    /* Set multi-function pins for UART0 RXD and TXD */
    SYS->GPA_MFPL = (SYS->GPA_MFPL & (~(UART0_RXD_PA6_Msk | UART0_TXD_PA7_Msk))) | UART0_RXD_PA6 | UART0_TXD_PA7;

}

void UART0_Init(void)
{
    /*---------------------------------------------------------------------------------------------------------*/
    /* Init UART                                                                                               */
    /*---------------------------------------------------------------------------------------------------------*/
    UART0->LINE = UART_PARITY_NONE | UART_STOP_BIT_1 | UART_WORD_LEN_8;
    UART0->BAUD = UART_BAUD_MODE2 | UART_BAUD_MODE2_DIVIDER(__HIRC, 115200);

}



int main()
{
    SYS_UnlockReg();

    SYS_Init();
    UART0_Init();

    printf("\n");
    printf("+------------------------------------------------------------------+\n");
    printf("|              Simple Key Demo                                     |\n");
    printf("+------------------------------------------------------------------+\n");

    /* Init GPIO for LED toggle. */
    LED_INIT();
    LED_YELLOW = 1;
    LED_GREEN = 1;

    /* Enable debounce of PF11 */
    PF->DBEN = 0x800;
    PF->DBCTL |= GPIO_DBCTL_DBCLKSRC_Msk | 0x3;


    LED_YELLOW = 1;
    LED_GREEN = 0;
    while(1)
    {
        CLK_SysTickLongDelay(200000);

        /* Toggle LED */
        LED_YELLOW ^= 1;
        LED_GREEN ^= 1;


        if(PF11 == 0)
        {
            printf("SW2\n");
            LED_YELLOW = 0;
            LED_GREEN = 1;
            while(PF11 == 0);
        }

    }


}

/*** (C) COPYRIGHT 2020 Nuvoton Technology Corp. ***/
